{
  "id": "ALBA-2020:1713",
  "summary": "gcc-toolset-9-binutils bug fix and enhancement update",
  "affected": [
    {
      "package": {
        "ecosystem": "AlmaLinux:8",
        "name": "gcc-toolset-9-binutils"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "2.32-17.el8_1"
            }
          ]
        }
      ]
    },
    {
      "package": {
        "ecosystem": "AlmaLinux:8",
        "name": "gcc-toolset-9-binutils-devel"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "2.32-17.el8_1"
            }
          ]
        }
      ]
    },
    {
      "package": {
        "ecosystem": "AlmaLinux:8",
        "name": "gcc-toolset-9-binutils-devel"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "2.32-17.el8_1"
            }
          ]
        }
      ]
    }
  ],
  "aliases": [],
  "published": "2020-04-28T09:07:44Z",
  "modified": "2020-04-28T09:07:42Z",
  "details": "GCC Toolset is a compiler toolset that provides recent versions of development tools. GCC Toolset is an Application Stream packaged as a Software Collection.\n\nFor instructions on usage, see Using GCC Toolset linked from the References section. Components and specifics of this version are documented in the GCC Toolset 9 chapter. \n\nFor detailed changes in this release, see the AlmaLinux Release Notes.\n\nBug Fix(es):\n\n* Certain Intel CPUs are affected by the Jump Conditional Code (JCC) bug causing machine instructions to be executed incorrectly. Consequently, the affected CPUs might not execute programs properly. The full fix involves updating the microcode of vulnerable CPUs, which can cause a performance degradation. This update enables a workaround in the assembler that helps to mitigate the performance loss. The workaround is not enabled by default.\n\nTo apply the workaround, recompile a program using GCC with the \"-Wa,-mbranches-within-32B-boundaries\" command-line option. A program recompiled with this command-line option will not be affected by JCC flaw, but the microcode update is still necessary in order to fully protect a system. \n\nNote that applying the workaround will increase the size of the program and there can still be a slight performance decrease, although it should be less than it would have been without the recompilation. (BZ#1779417)",
  "references": [
    {
      "url": "https://errata.almalinux.org/8/ALBA-2020-1713.html",
      "type": "ADVISORY"
    }
  ]
}